In [1]:
#melt()
# used to unpivot a DataFrame from wide format to long format

In [2]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [13]:
df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

id_vars: The columns that you want to keep fixed (these columns will remain as identifiers).
value_vars: The columns you want to unpivot (the ones you want to "melt" into a single column).
var_name: The name to use for the new column that will contain the names of the melted columns (default is 'variable').
value_name: The name to use for the new column that will contain the values from the melted columns (default is 'value').
col_level: Used for multi-level column DataFrames.

In [4]:
# pivot is reverse of melt

pivot(): longer to wide, it is used to turn long-format data into wide-format data. This is the reverse operation of melt().
syntax:
df.pivot(index=None, columns=None, values=None)
Parameters:
index: The column whose unique values will become the rows of the new DataFrame.
columns: The column whose unique values will become the columns of the new DataFrame.
values: The column whose values will fill the new DataFrame. These will become the actual data (values in the table).

In [1]:
# some problems related to melt and pivot

In [3]:
#problem 1:Use melt() to Reshape Student Scores
import pandas as pd
data = {
    'Student': ['Ali', 'Zara', 'Fahad'],
    'Math': [85, 90, 78],
    'English': [88, 95, 80]
}
df = pd.DataFrame(data)
df

  Student  Math  English
0     Ali    85       88
1    Zara    90       95
2   Fahad    78       80

In [6]:
df.melt(id_vars=["Student"], value_vars=["Math", "English"], var_name="Subject", value_name="Marks")

  Student  Subject  Marks
0     Ali     Math     85
1    Zara     Math     90
2   Fahad     Math     78
3     Ali  English     88
4    Zara  English     95
5   Fahad  English     80

In [14]:
#problem 2: Use pivot() to Convert Back to Wide Format 
data = {
    'Student': ['Ali', 'Ali', 'Zara', 'Zara'],
    'Subject': ['Math', 'English', 'Math', 'English'],
    'Marks': [85, 88, 90, 95]
}
df = pd.DataFrame(data)
df

  Student  Subject  Marks
0     Ali     Math     85
1     Ali  English     88
2    Zara     Math     90
3    Zara  English     95

In [34]:
new_df =df.pivot(index='Student', columns='Subject', values='Marks')

In [35]:
new_df

Subject  English  Math
Student
Ali           88    85
Zara          95    90

In [40]:
new_df.reset_index()

Subject  level_0  index Student  English  Math
0              0      0     Ali       88    85
1              1      1    Zara       95    90

In [41]:
#problem 3:
data = {
    'Student': ['Ali', 'Ali', 'Zara', 'Zara'],
    'Subject': ['Math', 'English', 'Math', 'English'],
    'Marks': [85, 88, 90, 95]
}
df = pd.DataFrame(data)
df

  Student  Subject  Marks
0     Ali     Math     85
1     Ali  English     88
2    Zara     Math     90
3    Zara  English     95

In [44]:
df_pivot = df.pivot(index='Student', columns='Subject', values='Marks')
df_pivot

Subject  English  Math
Student
Ali           88    85
Zara          95    90

In [45]:
#problem 4: use melt to reshape
data = {
    'Name': ['Ali', 'Zara'],
    'Test1': [88, 92],
    'Test2': [91, 85]
}
df = pd.DataFrame(data)
df

   Name  Test1  Test2
0   Ali     88     91
1  Zara     92     85

In [46]:
df.melt(id_vars=["Name"], value_vars=["Test1", "Test2"], var_name="Test", value_name="Score")

   Name   Test  Score
0   Ali  Test1     88
1  Zara  Test1     92
2   Ali  Test2     91
3  Zara  Test2     85